/* This file is Copyright 2000-2013 Meyer Sound Laboratories Inc.  See the included LICENSE.txt file for details. */

/******************************************************************************
/
/     File:     MuscleSupport.h
/
/     Description:  Standard types, macros, functions, etc, for MUSCLE.
/
*******************************************************************************/

#ifndef MuscleSupport_h
#define MuscleSupport_h

#define MUSCLE_VERSION_STRING "8.20" /**< The current version of the MUSCLE distribution, expressed as an ASCII string */
#define MUSCLE_VERSION        82000  /**< Current version, expressed as decimal Mmmbb, where (M) is the number before the decimal point, (mm) is the number after the decimal point, and (bb) is reserved */

/*! \mainpage MUSCLE Documentation Page
 *
 * The MUSCLE API provides a robust, efficient, scalable, cross-platform, client-server messaging system
 * for network-distributed applications for Linux, MacOS/X, BSD, Windows, BeOS, and other operating
 * systems.  It can be compiled using any C++ compiler that supports C++03 or higher (although C++11 or
 * higher is preferred) and can run under any OS with a TCP/IP stack and BSD-style sockets API.
 *
 * MUSCLE allows an arbitrary number of client programs (each of which may be running on a separate computer and/or
 * under a different OS) to communicate with each other in a many-to-many structured-message-passing style.  It

      typedef unsigned __int64       uint64;   /**< uint64 is a 64-bit unsigned integer type */
#    elif __APPLE__
#     ifndef _UINT64
#      define _UINT64                          /**< Avoid conflict with typedef in OS/X Leopard system header */
       typedef long long              int64;   /**< int64 is a 64-bit signed integer type */    // these are what's expected in MacOS/X land, in both
       typedef unsigned long long     uint64;  /**< uint64 is a 64-bit unsigned integer type */ // 32-bit and 64-bit flavors.  C'est la vie, non?
#     endif
#    elif defined(MUSCLE_64_BIT_PLATFORM)
      typedef long                   int64;    /**< int64 is a 64-bit signed integer type */
      typedef unsigned long          uint64;   /**< uint64 is a 64-bit unsigned integer type */
#    else
      typedef long long              int64;    /**< int64 is a 64-bit signed integer type */
      typedef unsigned long long     uint64;   /**< uint64 is a 64-bit unsigned integer type */
#    endif
#   else
     // If stdint.h is available, we might as well use it
     typedef  int8_t    int8; /**< int8 is an 8-bit signed integer type */
     typedef uint8_t   uint8; /**< uint8 is an 8-bit unsigned integer type */
     typedef  int16_t  int16; /**< int16 is a 16-bit signed integer type */
     typedef uint16_t uint16; /**< uint16 is a 16-bit unsigned integer type */
     typedef  int32_t  int32; /**< int32 is a 32-bit signed integer type */
     typedef uint32_t uint32; /**< uint32 is a 32-bit unsigned integer type */
     typedef  int64_t  int64; /**< int64 is a 64-bit signed integer type */
     typedef uint64_t uint64; /**< uint64 is a 64-bit unsigned integer type */
#   endif
     typedef int32 c_status_t; /**< For C programs: This type indicates an expected value of either CB_NO_ERROR/CB_OK on success, or another value (often CB_ERROR) on failure. */
#   if defined(__cplusplus)
     namespace muscle {
        /** This class represents a return-value from a function or method that indicates success or failure.
          * It's implemented as a class instead of as a typedef or enum so that the compiler can provide
          * stricter compile-time type-checking and better error-reporting functionality.  When a function
          * wants to indicate that it succeeded, it should return B_NO_ERROR (or B_OK, which is a synonym).
          * If the function wants to indicate that it failed, it can return B_ERROR to indicate a
          * general/undescribed failure, or one of the other B_SOMETHING values (as listed in
          * support/MuscleSupport.h), or it can return B_ERROR("Some Error Description") if it wants to
          * describe its failure using an ad-hoc human-readable string.  In that last case, make sure the
          * string you pass in to B_ERROR is a compile-time constant, or in some other way * will remain
          * valid indefinitely, since the status_t object will keep only a (const char *) pointer to the
          * string, and therefore depends on that pointed-to char-array remaining valid.
          */
        class status_t
        {
        public:
           /** Default-constructor.  Creates a status_t representing success. */
           MUSCLE_CONSTEXPR status_t() : _desc(NULL) {/* empty */}

           /** Explicit Constructor.
             * param desc An optional human-description of the error.  If passed in as NULL (the default), the status will represent success.
             * @note The (desc) string is NOT copied: only the pointer is retained, so any non-NULL (desc) argument
             *       should be a compile-time-constant string!
             */
           MUSCLE_CONSTEXPR explicit status_t(const char * desc) : _desc(desc) {/* empty */}

           /** Copy constructor
             * @param rhs the status_t to make this object a copy of
             */
           MUSCLE_CONSTEXPR status_t(const status_t & rhs) : _desc(rhs._desc) {/* empty */}

           /** Comparison operator.  Returns true iff this object is equivalent to (rhs).
             * @param rhs the status_t to compare against
             */
           MUSCLE_CONSTEXPR bool operator ==(const status_t & rhs) const
           {
              return _desc ? ((rhs._desc)&&(strcmp(_desc, rhs._desc) == 0)) : (rhs._desc == NULL);
           }

#ifdef MUSCLE_USE_CPLUSPLUS17
           /** This method returns B_NO_ERROR iff both inputs are equal to B_NO_ERROR,
             * otherwise it returns the first non-B_NO_ERROR value available.  This method is
             * useful for chaining a ordered series of operations together and then
             * checking the aggregate result (e.g. status_t ret = a().And(b()).And(c()).And(d());)
             * @param rhs the second status_t to test this status_t against
             * @note Unlike with the | operator (below), the order-of-operations here is
             *       well-defined; however, this method is available only under C++17 or
             *       later, because older versions of C++ don't specify a well-defined
             *       order of operations for chained methods.
             * @note No short-circuiting is performed.
             */
           MUSCLE_CONSTEXPR status_t And(const status_t & rhs) const {return ((rhs.IsError())&&(!IsError())) ? rhs : *this;}
#endif

           /** Comparison operator.  Returns true iff this object has a different value than (rhs)
             * @param rhs the status_t to compare against
             */
           MUSCLE_CONSTEXPR bool operator !=(const status_t & rhs) const {return !(*this==rhs);}

           /** This operator returns B_NO_ERROR iff both inputs are equal to B_NO_ERROR,
             * otherwise it returns one of the non-B_NO_ERROR values.  This operator is
             * useful for aggregating a unordered series of operations together and
             * checking the aggregate result (e.g. status_t ret = a() | b() | c() | d())
             * @param rhs the second status_t to test this status_t against
             * @note Due to the way the | operator is defined in C++, the order of evaluations
             *       of the operations in the series in unspecified.  Also, no short-circuiting
             *       is performed; all operands will be evaluated regardless of their values.
             */
           MUSCLE_CONSTEXPR status_t operator | (const status_t & rhs) const {return ((rhs.IsError())&&(!IsError())) ? rhs : *this;}

           /** Sets this object equal to ((*this)|rhs).
             * @param rhs the second status_t to test this status_t against
             */
           status_t & operator |= (const status_t & rhs) {*this = ((*this)|rhs); return *this;}

           /** @copydoc DoxyTemplate::operator=(const DoxyTemplate &) */
           status_t & operator = (const status_t & rhs) {_desc = rhs._desc; return *this;}

           /** Returns "OK" if this status_t indicates success; otherwise returns the human-readable description
             * of the error this status_t indicates.
             */
           MUSCLE_CONSTEXPR const char * GetDescription() const {return IsOK() ? "OK" : _desc;}

           /** Convenience method -- a synonym for GetDescription() */
           MUSCLE_CONSTEXPR const char * operator()() const {return GetDescription();}

           /** Convenience method:  Returns true this object represents an ok/non-error status */
           MUSCLE_CONSTEXPR bool IsOK() const {return (_desc == NULL);}

           /** Convenience method:  Returns true iff this object represents an ok/non-error status
             * @param writeErrorTo If this object represents an error, the error will be copied into (writeErrorTo)
             * @note this allows for e.g. status_t ret; if ((func1().IsOK(ret))&&(func2().IsOK(ret))) {....} else return ret;
             */
           bool IsOK(status_t & writeErrorTo) const
           {
              const bool isOK = IsOK();
              if (isOK == false) writeErrorTo = *this;
              return isOK;
           }

           /** Convenience method:  Returns true iff this object represents an error-status */
           MUSCLE_CONSTEXPR bool IsError() const {return (_desc != NULL);}

           /** Convenience method:  Returns true iff this object represents an error-status
             * @param writeErrorTo If this object represents an error, the error will be copied into (writeErrorTo)
             * @note this allows for e.g. status_t ret; if ((func1().IsError(ret))||(func2().IsError(ret))) return ret;
             */
           bool IsError(status_t & writeErrorTo) const
           {
              const bool isError = IsError();
              if (isError) writeErrorTo = *this;
              return isError;
           }

           /** Returns a status_t with the given error-string.  (Added to allow e.g. B_ERROR("The Reason Why") syntax)
             * @param desc the error-string the returned status_t should have.  Should be a compile-time constant.
             * @note if this is called on a status_t that has a NULL error-string, then (desc) will be ignored and
             *       the returned status_t will also have a NULL error string.  That is to avoid doing the wrong thing
             *       if someone tries to do a B_NO_ERROR("Yay") or etc.
             */
           MUSCLE_CONSTEXPR status_t operator()(const char * desc) const {return status_t(_desc?desc:NULL);}

        private:
           const char * _desc;  // If non-NULL, we represent an error
        };

        // Basic/general status_t return codes
        const status_t B_NO_ERROR;       ///< This value is returned by a function or method that succeeded
        const status_t B_OK;             ///< This value is a synonym for B_NO_ERROR
        const status_t B_ERROR("Error"); ///< "Error": This value is returned by a function or method that errored out in a non-descript fashion
#       define B_ERRNO B_ERROR(strerror(GetErrno())) ///< Macro for return a B_ERROR with the current errno-string as its string-value
#       define B_ERRNUM(errnum) ((errnum==0)?B_NO_ERROR:B_ERROR(strerror(errnum))) ///< Macro for converting an errno-style return value (0==success, negative==error_value) result into a status_t

        // Some more-specific status_t return codes (for convenience, and to minimize the likelihood of
        // differently-phrased error strings for common types of reasons-for-failure)
        extern const status_t B_OUT_OF_MEMORY;  ///< "Out of Memory"  - we tried to allocate memory from the heap and got denied
        extern const status_t B_UNIMPLEMENTED;  ///< "Unimplemented"  - function is not implemented (for this OS?)
        extern const status_t B_ACCESS_DENIED;  ///< "Access Denied"  - we aren't allowed to do the thing we tried to do
        extern const status_t B_DATA_NOT_FOUND; ///< "Data not Found" - we couldn't find the data we were looking for
        extern const status_t B_FILE_NOT_FOUND; ///< "File not Found" - we couldn't find the file we were looking for
        extern const status_t B_BAD_ARGUMENT;   ///< "Bad Argument"   - one of the passed-in arguments didn't make sense
        extern const status_t B_BAD_DATA;       ///< "Bad Data"       - data we were trying to use was malformed
        extern const status_t B_BAD_OBJECT;     ///< "Bad Object"     - the object the method was called on is not in a usable state for this operation
        extern const status_t B_TIMED_OUT;      ///< "Timed Out"      - the operation took too long, so we gave up
        extern const status_t B_IO_ERROR;       ///< "I/O Error"      - an I/O operation failed
        extern const status_t B_LOCK_FAILED;    ///< "Lock Failed"    - an attempt to lock a shared resource (e.g. a Mutex) failed.
        extern const status_t B_TYPE_MISMATCH;  ///< "Type Mismatch"  - tried to fit a square block into a round hole
        extern const status_t B_ZLIB_ERROR;     ///< "ZLib Error"     - a zlib library-function reported an error
        extern const status_t B_SSL_ERROR;      ///< "SSL Error"      - an OpenSSL library-function reported an error
        extern const status_t B_LOGIC_ERROR;    ///< "Logic Error"    - internal logic has gone wrong somehow (bug?)
     };
#   endif  /* defined(__cplusplus) */
#  endif  /* !MUSCLE_TYPES_PREDEFINED */
# endif  /* !__ATHEOS__*/
#endif  /* __BEOS__ || __HAIKU__ */

#ifdef __cplusplus
template<typename T, size_t size> MUSCLE_CONSTEXPR uint32 ARRAYITEMS(T(&)[size]) {return (uint32) size;}  /**< Returns # of items in the 1D array.  Will error out at compile time if you try to call it with a pointer as an argument.  */
template<typename T, size_t rows, size_t cols> MUSCLE_CONSTEXPR uint32 ARRAYROWS(T(&)[rows][cols]) {return (uint32) rows;} /**< Returns # of "rows", along the first axis of the 2D array.  Will error out at compile time if you try to call it with a pointer as an argument.  */
template<typename T, size_t rows, size_t cols> MUSCLE_CONSTEXPR uint32 ARRAYCOLS(T(&)[rows][cols]) {return (uint32) cols;} /**< Returns # of "columns", along the second axis of the 2D array.  Will error out at compile time if you try to call it with a pointer as an argument.  */
#else
# define ARRAYITEMS(x) (sizeof(x)/sizeof(x[0]))  /**< Returns # of items in the array.  This primitive C-compatible implementation will return an incorrect value if called with a pointer as an argument. */
#endif
typedef void * muscleVoidPointer;  /**< Synonym for a (void *) -- it's a bit easier, syntax-wise, to use this type than (void *) directly in some cases. */

#if defined(__cplusplus) && !defined(MUSCLE_AVOID_CPLUSPLUS11)
// Let's try to catch any type-size errors at compile-time if we can
static_assert(sizeof(int8)   == 1, "sizeof(int8) != 1");
static_assert(sizeof(uint8)  == 1, "sizeof(uint8) != 1");
static_assert(sizeof(int16)  == 2, "sizeof(int16) != 2");
static_assert(sizeof(uint16) == 2, "sizeof(uint16) != 2");
static_assert(sizeof(int32)  == 4, "sizeof(int32) != 4");
static_assert(sizeof(uint32) == 4, "sizeof(uint32) != 4");
static_assert(sizeof(int64)  == 8, "sizeof(int64) != 8");
static_assert(sizeof(uint64) == 8, "sizeof(uint64) != 8");
static_assert(sizeof(float)  == 4, "sizeof(float) != 4");
static_assert(sizeof(float)  == 4, "sizeof(float) != 4");
static_assert(sizeof(double) == 8, "sizeof(double) != 8");
static_assert(sizeof(double) == 8, "sizeof(double) != 8");
#endif

#ifdef MUSCLE_AVOID_STDINT
/** Ugly platform-neutral macros for problematic sprintf()-format-strings */
# if defined(MUSCLE_64_BIT_PLATFORM)
#  define  INT32_FORMAT_SPEC_NOPERCENT "i"  /**< format-specifier string to pass in to printf() for an int32, without the percent sign */
#  define UINT32_FORMAT_SPEC_NOPERCENT "u"  /**< format-specifier string to pass in to printf() for a uint32, without the percent sign */
#  define XINT32_FORMAT_SPEC_NOPERCENT "x"  /**< format-specifier string to pass in to printf() for an int32 or uint32 that you want printed in hexadecimal, without the percent sign */
#  ifdef __APPLE__
#   define  INT64_FORMAT_SPEC_NOPERCENT "lli"  /**< format-specifier string to pass in to printf() for an int64, without the percent sign */
#   define UINT64_FORMAT_SPEC_NOPERCENT "llu"  /**< format-specifier string to pass in to printf() for a uint64, without the percent sign */
